/* a
signOut না দিয়ে logOut দেওয়ার মূল কারণ যেন ফায়ারবেজ এর signOut 
এর সাথে মিলে না যাই, মিলে গেলে অটো ইমপোর্ট হয় না এবং 
এই ফাংশন কোন প্যারামিটার নেবে না 
 */

/* b
যেহেতু logOut ফাংশন কোন প্যারামিটার নেয় না সেহেতু
  ফায়ার বেজ এর signOut  ও কোন বাড়তি প্যারামিটার নেবে না 
  শুধুমাত্র firebase এর auath ছাড়া 
*/

/* c
onAuthStateChanged এটাকে যদি ভেরিয়েবলে না রাখি তাহলে এটা সারাক্ষণ 
observing চালু রাখে অর্থাৎ যখন এই অ্যাপ্লিকেশন ছেড়ে অন্য 
অ্যাপ্লিকেশনে চলে যায় তখনও observing চালু থাকে । তো 
এই সমস্যা দূর করার জন্য অর্থাৎ observing-কে হোল্ড করে
 রাখার জন্য observing কে variablel-এ রাখা লাগে 

*/